#include <stdio.h> 
#include <string.h>
// Á÷¿ø
struct employee {
	int number;   // »ç¹ø
	char name[20];   // ÀÌ¸§
	int age;  // ³ªÀÌ
	char tel[20];   // ÀüÈ­¹øÈ£ 
}; 

int main(void)
{
	struct employee e[10] = {
		{ 1, "È«±æµ¿1", 20, "111-1111" },
		{ 2, "È«±æµ¿2", 25, "111-1112" },
		{ 3, "È«±æµ¿3", 60, "111-1113" },
		{ 4, "È«±æµ¿4", 40, "111-1114" },
		{ 5, "È«±æµ¿5", 50, "111-1115" },
		{ 6, "È«±æµ¿6", 45, "111-1116" }, 
		{ 7, "È«±æµ¿7", 32, "111-1117" },
		{ 8, "È«±æµ¿8", 23, "111-1118" },
		{ 9, "È«±æµ¿9", 29, "111-1119" },
		{ 10, "È«±æµ¿10", 62, "111-1120" }};
	
	int i;
	for(i=0; i<10; i++)
		if( e[i].age >= 20 && e[i].age <= 30 ) 
			printf("%s\n", e[i].name);
	
	return 0; 
}
